{
  "sections": [
    {
      "id": "Java",
      "title": "Java",
      "description": "Java Interview Questions for Automation testing",
      "image": "/images/introduction.jpg",
      "modules": [
        {
          "title": "1. Why is Java a platform independent language?",
          "content": ["Java is platform independent because Java programs are compiled into bytecode, which can run on any computer that has a Java Virtual Machine (JVM).",

            "You write Java code once.",

            "The compiler converts it to bytecode.",

            "The JVM on any operating system (Windows, Mac, Linux) can run that bytecode.",

            "So the same program runs anywhere without changing the code."
          ],
          "image": "/images/11.png"
        },
        {
          "title": "2. Why is Java not a pure object oriented language?",
          "content":[
            "Java supports primitive data types - byte, boolean, char, short, int, float, long, and double, and hence it is not a pure object-oriented language.",
            "Non-primitive data types are complex data types that are created from primitive types or by the programmer. Examples include arrays, which store multiple values of the same type; strings, which store a sequence of characters; classes and objects, which are user-defined types containing properties and methods; and collections like lists, sets, and maps, which can hold many items together.",
            "Non-primitive data is stored in heap memory, which is used for bigger and dynamic data, while the variable that points to this data is stored in stack memory. For example, when a string is created, the actual characters of the string are stored in the heap, and the stack stores a reference, which is the memory address pointing to the string object in the heap. Whenever the program accesses the string, it uses the reference on the stack to locate and manipulate the string object in the heap.",
            "The stack and heap are connected through these references, meaning the stack keeps track of where the objects in the heap are located. This allows the program to efficiently manage memory: the stack handles method calls and local variables, while the heap stores complex objects that can be shared or dynamically resized during runtime."
          ]
        },
        {
          "title": "3. Difference between Heap and Stack Memory in java. And how java utilizes this.",
          "content": [
            "Stack memory in Java is used to store local variables and function calls. It is fast and organized in a last-in, first-out (LIFO) way.",
            "Heap memory in Java is used to store objects and non-primitive data like arrays and strings. It is bigger than stack memory and can grow dynamically.",
            "In stack memory, variables store actual values for primitives and references (memory addresses) for objects. In heap memory, the actual objects and their data are stored.",
            "Java uses stack memory for method execution and temporary variables, while it uses heap memory to store objects that can be accessed from anywhere in the program.",
            "Stack and heap are connected through references. For example, a variable on the stack can point to an object in the heap, allowing the program to access and use that object.",
            "Stack memory is the portion of memory that is assigned to every individual program, and its size is fixed.",
            "Heap memory is the portion of memory that is not pre-allocated to the Java program but is available for use during runtime, mostly for storing objects.",
            "Java utilizes this memory as follows: all variables, methods, and function calls are stored in the stack memory.",
            "When we create any object in a Java program, the object is created in the heap memory, and the stack stores a reference (memory address) to that object.",
            "The stack and heap are connected through these references, allowing the program to access objects stored in the heap using variables stored in the stack.",
            "Main and PrintArray is the method that will be available in the stack area and as well as the variables declared that will also be in the stack area.",
            "And the Object (Integer Array of size 10) we have created, will be available in the Heap area because that space will be allocated to the program during runtime." ]
        },
        {
          "title": "4. Can java be said to be the complete object-oriented programming language?",
          "content":[
            "It is not wrong to claim that Java is a complete object-oriented programming language because most things in Java are defined under classes and can be accessed by creating objects.",
            "However, Java is not considered a completely object-oriented programming language because it supports primitive data types like int, float, char, boolean, and double.",
            "Therefore, the answer to the question 'Is Java a completely object-oriented programming language?' is: Java is not a pure object-oriented language because primitive data types can be used directly, and they do not belong to classes like Integer, Float, or Boolean."
          ]
        },
        {
          "title": "5. Pointers are used in C/ C++. Why does Java not make use of pointers?",
          "content": [
            "Pointers are special variables in C/C++ that store the memory address of another variable.",
            "Java does not use pointers because they are confusing and can cause errors like crashing the program or security problems.",
            "Instead of pointers, Java uses references for objects, which safely point to the object in memory without letting the programmer directly change memory addresses."
          ]
        }
      ]
    },
    {
      "id": "learning",
      "title": "Learning Path",
      "description": "Step-by-step roadmap to become Automation & DevOps Engineer",
      "image": "/images/Learning.jpg",
      "modules": [
        {
          "title": "Java Coding",
          "content": "Coding Questions for Interview.",
          "image": "/images/coding.jpg"
        },
        {
          "title": "Selenium & Playwright",
          "content": "Hands-on tutorials for Selenium and Playwright test automation tools."
        },
        {
          "title": "TestNG & PyTest",
          "content": "Understand how to structure tests using TestNG and PyTest frameworks."
        },
        {
          "title": "Git & GitHub",
          "content": "Version control with Git and collaborating with GitHub repositories."
        },
        {
          "title": "Docker Fundamentals",
          "content": "Introduction to Docker containers for consistent development environments."
        },
        {
          "title": "Jenkins Pipelines",
          "content": "Create CI/CD pipelines using Jenkins to automate your deployments."
        }
      ]
    }
  ]
}
